Repository: Evaldash/lp-express-shipping-method-for-woocommerce
Catalog: languages/lp-express-shipping-method-for-woocommerce-*.po
Languages: lt_lt

source: "LP Express" courier
lt_lt: LP Express kurjeriai

source: Shipping via "LP Express" courier services
lt_lt: LP Express kurjerių pristatymas

source: Title
lt_lt: Pavadinimas

source: Title to be display on site
lt_lt: Pavadinimas, kuris bus rodomas puslapyje

source: Cost
lt_lt: Kaina

source: Shipping price
lt_lt: Pristatymo kaina

source: Free shipping
lt_lt: Nemokamas pristatymas

source: Free shipping if price greater than (0 - turned off)
lt_lt: Nemokamas pristatymas nuo nurodytos sumos (0 - visada mokamas)

source: Tax status
lt_lt: Mokesčiai

source: Taxable
lt_lt: Pridėti mokesčius

# Tax status
source: None
lt_lt: Neapmokestinama

source: "LP Express" parcel terminals
lt_lt: LP Express paštomatai

source: Shipping to "LP Express" self-service parcel terminals
lt_lt: Pristatymas į LP Express paštomatus

source: Please select a parcel terminal
lt_lt: Prašome pasirinkti norimą paštomatą

source: Choose terminal
lt_lt: Pasirinkite terminalą

# empty value label for terminals
source: - Choose terminal -
lt_lt: - Pasirinkite terminala -

source: Chosen terminal
lt_lt: Pasirinktas terminalas

source: Address
lt_lt: Adresas

source: Comment
lt_lt: Komentaras
